[
    {
        "title": "Travel in Time of Covid19",
        "img": "https://i.ibb.co/V9VBV02/blog-1.jpg",
        "description": "As I start typing away, my mind wanders, was ‘Travel or lack of it in time of Covid19’ a better title? But then I go ahead and keep typing. I hardly write anything these days, I hardly travel too!",
        "details": "As I start typing away, my mind wanders, was ‘Travel or lack of it in time of Covid19’ a better title? But then I go ahead and keep typing. I hardly write anything these days, I hardly travel too! Growing up in a small town, Gorakhpur, UP in the 1970s and the 80s travel was not on my horizon. My father worked for the Indian Railways but we didn’t travel much. In those days eating out was not common, there was no five star hotel in my town and I hardly knew any friend who ever took a flight! Gorakhpur is an Airforce base so I saw a lot of fighter planes flying overhead and that was all. Or the stories my father brought back home, he did take a few flights, visited five star hotels and other countries but all for work. My eyes would widen listening to those tales, of the grand lobbies, the interiors of a plane, the expensive food in fancy hotels and lands far away."
    },
    {
        "title": "Going Places VI",
        "img": "https://i.ibb.co/sCXHLvK/blog-2.jpg",
        "description": "I started a series during the Covid times called going places where I started documenting all the 32 countries I have been to, through Instagram Reels. Then travel happened, in small doses but still it happened.",
        "details": "I started a series during the Covid times called going places where I started documenting all the 32 countries I have been to, through Instagram Reels. Then travel happened, in small doses but still it happened. And I got caught in it. And a lot of stuff in real life too. But here I am, back with the going places part VI.  You can read the parts I II III IV and V from the respective links. I visited Myanmar, Czech Republic, Oman, Spain and Mauritius next. Myanmar, Spain and Oman were blogging trips. Czech Republic and Mauritius were personal holidays."
    },
    {
        "title": "The Grand Dragon Ladakh",
        "img": "https://i.ibb.co/GCMMNgz/blog-3.jpg",
        "description": "his was my second stay at the Grand Dragon Ladakh. The first time I stayed there, it was of January 2016. Both the times I have stayed as a blogger, my stay was complimentary.",
        "details": "his was my second stay at the Grand Dragon Ladakh. The first time I stayed there, it was of January 2016. Both the times I have stayed as a blogger, my stay was complimentary. There are two ways in which I can start the story. In September 2021 I called my friend Meenaskhi and asked for a recommendation for a homestay in Ladakh. She convinced me to stay at the Grand Dragon instead. Not that it needed much convincing. I stayed there before, I knew how good it is."
    },
    {
        "title": "The Delhi Leh Flight at Sunrise",
        "img": "https://i.ibb.co/519TDwx/blog-4.jpg",
        "description": "I recently visited Ladakh for the 5th time. The first time, way back in 2005 my husband and I did a road trip using public transport. After that I have always taken a flight. ",
        "details": "I recently visited Ladakh for the 5th time. The first time, way back in 2005 my husband and I did a road trip using public transport. After that I have always taken a flight. This time when I was booking my flights I saw one with 5.30 am departure from Delhi. I thought I would get to see the sunrise over the mountains, so I took my chance and booked it. And magic happened! I do not regret leaving home at 3.00 am nor do I regret paying 200 rupees to block A 29 seat in advance, so that I could sleep in peace knowing my seat was assured."
    },
    {
        "title": "Fall Colors in Ladakh",
        "img": "https://i.ibb.co/LY83JZv/blog-5.jpg",
        "description": "I feel so blessed that I am able to travel again! The second trip of the year was to Leh, Ladakh. I was yearning to go on a break! The stars aligned and I finalized a trip to Leh. ",
        "details": "I feel so blessed that I am able to travel again! The second trip of the year was to Leh, Ladakh. I was yearning to go on a break! The stars aligned and I finalized a trip to Leh. Even though I had no plans I was hopeful that I would see fall colors in Ladakh! I had no idea what to expect or where to go though. I made the rookie mistake of going for an evening walk on my first day in Leh. I was feeling fresh but by the time I came back, I had headache. On top of that I did not increase my water intake. The next day I woke up with a terrible headache. I was forced to sit and laze around the hotel when I should have been up and running!"
    },
    {
        "title": "A Beautiful Safari Lodge",
        "img": "https://i.ibb.co/6NGsFgp/blog-6.jpg",
        "description": "I traveled to Sariska in September after a long time. My last trip was to Coimbatore in February 2020. A few travel opportunities did come my way but I was not confident about it so I kept saying no.",
        "details": "I traveled to Sariska in September after a long time. My last trip was to Coimbatore in February 2020. A few travel opportunities did come my way but I was not confident about it so I kept saying no. I had such mixed emotions, traveling after such a long time. I was hanging on to my mask like anything. Our first stop was Mannat Dhaba at the highway. I ordered gobhi paratha and chai. Paratha came with white butter. It was my first stop at a restaurant after you know it by now, February 2020. Suddenly things that I completely took for granted felt almost new!"
    }
]